000100200212             PGM
000101200212             CALL       STRJOB
000102200212             ADDLIBLE   BCI433LIB
000103200212
000104200212             MONMSG     CPF2103
000105200212             DSPSYSLVL  OUTPUT(*DISPLAY)
000106200212             ENDPGM
000107200212
