000001200129       dcl-f INCOMETDSP WORKSTN;
000002200129
000003200130       EXFMT GetIncome;
000004200130       DOW NOT(*IN03);
000006200130
000007200129
000008200129       IF IncomeAmt = 0;
000009200129         *IN98 = *ON; //Zero Income Amount
000010200129         EXFMT GetIncome;
000011200129         *IN98 = *OFF;
000012200129         ITER; // Go to the ENDO for next loop
000013200129
000014200129       ELSEIF MARRIED = ' ';
000015200129         *IN97 = *ON;
000016200129       ELSE;
000017200130         DEDUCTIONS = EXPENSE + DONATIONS;
000018200130         AINCOMEAMT = INCOMEAMT - DEDUCTIONS;
000020200130         EXSR GetTaxRate;
000021200129
000022200129       ENDIF;
000023200129
000024200130       DAYSTOPAY = 5;
000025200130       EVAL(H) TAXESOWING = 1000;
000026200130
000027200129
000028200129       //PROTECT FIRST SCREEN RECORD FIELDS
000029200129       //REDISPLAY FIRST SCREEN RECORD AND THEN OVERLAY SECOND RECORD
000030200129
000031200130       *IN60=*ON;
000032200130       WRITE GetIncome;
000033200130       EXFMT YourTax;
000034200130       *IN60=*OFF;
000035200129
000036200129        IF *IN03=*OFF;
000037200129          EXSR CLEAR;
000038200129          EXFMT GetIncome;
000039200129        ENDIF;
000040200129       ENDDO;
000041200129       *INLR = *ON;
000042200129       RETURN;
000043200130       BEGSR GetTaxRate;
000044200130         TaxRate= .10;
000045200130       ENDSR;
000046200130
000047200130       BEGSR CLEAR;
000048200130
000049200130       ENDSR;
000050200129
000051200129
