000001200130       dcl-f INCOMETDSP WORKSTN;
000003200204
000004200204     DTODAY            S               D
000005200204     DDUEDATE          S               D
000006200204     DWDUEDATE         S              8  0 INZ(20200430)
000007200130       EXFMT GetIncome;
000008200130       DOW NOT(*IN03);
000011200130
000012200129
000013200129       IF IncomeAmt = 0;
000014200129         *IN98 = *ON; //Zero Income Amount
000015200129         EXFMT GetIncome;
000016200129         *IN98 = *OFF;
000017200129         ITER; // Go to the ENDO for next loop
000018200129
000019200129       ELSEIF MARRIED = ' ';
000020200129         *IN97 = *ON;
000021200129       ELSE;
000022200204         IF EXPENSE > 4000;
000023200204           EXPENSE = 4000;
000024200204         ENDIF;
000025200204         IF DONATIONS > 10000;
000026200204           DONATIONS = 10000;
000027200204         ENDIF;
000028200130         DEDUCTIONS = EXPENSE + DONATIONS;
000029200130         AINCOMEAMT = INCOMEAMT - DEDUCTIONS;
000030200130         EXSR GetTaxRate;
000031200129
000032200204
000033200204       ENDIF;
000040200204       TODAY = %DATE();
000041200204       DUEDATE = %DATE( WDUEDATE );
000042200204       DAYSTOPAY = %DIFF(DUEDATE:TODAY: *DAYS);
000048200129
000049200129       //PROTECT FIRST SCREEN RECORD FIELDS
000050200129       //REDISPLAY FIRST SCREEN RECORD AND THEN OVERLAY SECOND RECORD
000051200129
000052200130       *IN60=*ON;
000053200130       WRITE GetIncome;
000054200130       EXFMT YourTax;
000055200130       *IN60=*OFF;
000056200129
000057200129        IF *IN03=*OFF;
000058200129          EXSR CLEAR;
000059200129          EXFMT GetIncome;
000060200129        ENDIF;
000061200129       ENDDO;
000062200129       *INLR = *ON;
000063200129       RETURN;
000064200130       BEGSR GetTaxRate;
000065200204         IF MARRIED = 'Y';
000066200204           SELECT;
000067200204             WHEN AINCOMEAMT <= 19050;
000068200204               TAXRATE = .10;
000069200204             WHEN AINCOMEAMT <= 77400;
000070200204               TAXRATE = .12;
000071200204             WHEN AINCOMEAMT <= 165000;
000072200204               TAXRATE = .22;
000073200204             WHEN AINCOMEAMT <= 315000;
000074200204               TAXRATE = .24;
000075200204             WHEN AINCOMEAMT <= 400000;
000076200204               TAXRATE = .32;
000077200204             WHEN AINCOMEAMT <= 600000;
000078200204               TAXRATE = .35;
000079200204             WHEN AINCOMEAMT > 600000;
000080200204               TAXRATE = .37;
000081200204             OTHER;
000082200204               TAXRATE = .99;
000083200204           ENDSL;
000084200204           ELSEIF MARRIED = 'N';
000085200204             SELECT;
000086200204               WHEN AINCOMEAMT <= 9525;
000087200204                 TAXRATE = .10;
000088200204               WHEN AINCOMEAMT <= 38700;
000089200204                 TAXRATE = .12;
000090200204               WHEN AINCOMEAMT <= 82500;
000091200204                 TAXRATE = .22;
000092200204               WHEN AINCOMEAMT <= 157500;
000093200204                 TAXRATE = .24;
000094200204               WHEN AINCOMEAMT <= 200000;
000095200204                 TAXRATE = .32;
000096200204               WHEN AINCOMEAMT <= 500000;
000097200204                 TAXRATE = .35;
000098200204               WHEN AINCOMEAMT > 500000;
000099200204                 TAXRATE = .37;
000100200204               OTHER;
000101200204                 TAXRATE = .99;
000102200204             ENDSL;
000103200204         ENDIF;
000104200204         //TaxRate= .10;
000105200204       EVAL(H) TAXESOWING = AINCOMEAMT * TAXRATE;
000106200130       ENDSR;
000107200130
000108200130       BEGSR CLEAR;
000109200130            INCOMEAMT = 0;
000110200130            MARRIED = '';
000111200130            EXPENSE = 0;
000112200130            DONATIONS = 0;
000113200130
000114200130
000115200130
000116200130
000117200130       ENDSR;
000118200129
000119200129
